In [1]:
people = {
    'first': ['steve', 'jane', 'john'],
    'last': ['jobs', 'doe', 'doe'],
    'email': ['stevejob@email.com', 'janedoe@email.com', 'johndoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)
df

   first  last               email
0  steve  jobs  stevejob@email.com
1   jane   doe   janedoe@email.com
2   john   doe   johndoe@email.com

### Combine columns

In [4]:
df['first'] +' '+ df['last']

0    steve jobs
1      jane doe
2      john doe
dtype: object

In [5]:
df['full_name'] = df['first'] +' '+ df['last']
df

   first  last               email   full_name
0  steve  jobs  stevejob@email.com  steve jobs
1   jane   doe   janedoe@email.com    jane doe
2   john   doe   johndoe@email.com    john doe

### Remove columns

In [6]:
df.drop(columns=['first', 'last'], inplace=True)
df

                email   full_name
0  stevejob@email.com  steve jobs
1   janedoe@email.com    jane doe
2   johndoe@email.com    john doe

### Splitting column

we can split columns and join with current data frame.
use argument 'expand=True' to convert list into dataframe

In [7]:
df['full_name'].str.split(' ', expand=True)

       0     1
0  steve  jobs
1   jane   doe
2   john   doe

In [8]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
df

                email   full_name  first  last
0  stevejob@email.com  steve jobs  steve  jobs
1   janedoe@email.com    jane doe   jane   doe
2   johndoe@email.com    john doe   john   doe

### Append dataframe 

append dataframe with other dataframe

but here i use pandas.concat to append dataframe

In [9]:
people = {
    'first': ['stephen', 'curry'],
    'last': ['halland', 'op'],
    'email': ['stphncurry@email.com', 'hallandop@email.com']
}
df2 = pd.DataFrame(people)
df2

     first     last                 email
0  stephen  halland  stphncurry@email.com
1    curry       op   hallandop@email.com

In [10]:
df = pd.concat([df, df2])
df.reset_index(drop=True, inplace=True)

In [11]:
df

                  email   full_name    first     last
0    stevejob@email.com  steve jobs    steve     jobs
1     janedoe@email.com    jane doe     jane      doe
2     johndoe@email.com    john doe     john      doe
3  stphncurry@email.com         NaN  stephen  halland
4   hallandop@email.com         NaN    curry       op

### Remove Rows

to remove rows, we can use drop method

In [12]:
df.drop(index=4)

                  email   full_name    first     last
0    stevejob@email.com  steve jobs    steve     jobs
1     janedoe@email.com    jane doe     jane      doe
2     johndoe@email.com    john doe     john      doe
3  stphncurry@email.com         NaN  stephen  halland

In [24]:
df.drop(index=df[df['last'] == 'doe'].index)

                  email   full_name    first     last
0    stevejob@email.com  steve jobs    steve     jobs
3  stphncurry@email.com         NaN  stephen  halland
4   hallandop@email.com         NaN    curry       op

In [25]:
df

                  email   full_name    first     last
0    stevejob@email.com  steve jobs    steve     jobs
1     janedoe@email.com    jane doe     jane      doe
2     johndoe@email.com    john doe     john      doe
3  stphncurry@email.com         NaN  stephen  halland
4   hallandop@email.com         NaN    curry       op